import ax2 from '../../assets/genres/actionAdventure/ax-2.jpg';
import silentHill from '../../assets/genres/actionAdventure/silent-hill.jpg';

import metroid from '../../assets/genres/actionAdventure/metroid.jpg';
import castelvania from '../../assets/genres/actionAdventure/castelvania.jpg';

export const actionAdventureParagraph = {
  first: 'Хоча пригодницькі ігри можна поділити на екшн та пригодницькі, вони поєднують у собі елементи обох цих жанрів,\n' +
    '        як правило, з довготривалими перешкодами, які потрібно подолати, використовуючи інструмент або предмет як важіль\n' +
    '        (зібраний раніше), а також безліччю дрібніших перешкод, які майже постійно трапляються на шляху і для подолання\n' +
    '        яких потрібні елементи екшн-ігор. Пригодницькі ігри, як правило, зосереджені на дослідженні і зазвичай включають\n' +
    '        збір предметів, розв\'язання простих головоломок і битви. "Пригодницький екшн" став ярликом, який іноді\n' +
    '        прикріплюють до ігор, що не вписуються в інший добре відомий жанр. Через їхню поширеність на ігрових приставках\n' +
    '        і відсутність типових пригодницьких ігор, сучасні геймери часто називають екшн-пригоди "пригодницькими іграми".',
  second: 'Однією з перших пригодницьких ігор була гра Adventure для Atari 2600 (1980). Вона була безпосередньо натхненна\n' +
    '        оригінальною текстовою пригодницькою грою Colossal Cave Adventure. У процесі адаптації текстової гри до консолі,\n' +
    '        що мала лише джойстик для керування, дизайнер Уоррен Робінетт створив пригодницьку гру, додавши до неї елементи\n' +
    '        екшн-аркади.',
  third: 'Пізніше пригодницький екшн став усталеним жанром завдяки грі Шіґеру Міямото "Легенда про Зельду" (1986), яка\n' +
    '        стала успішною завдяки поєднанню елементів різних жанрів для створення переконливого гібриду, включаючи\n' +
    '        дослідження, транспортні головоломки, пригодницькі головоломки з інвентарем, екшн-компонент, грошову систему та\n' +
    '        спрощену побудову рівнів у стилі рольових ігор без очок досвіду. Гра також стала раннім прикладом відкритого\n' +
    '        світу, нелінійного геймплея та запровадила інновації, як-от економія заряду акумулятора. Вона стала однією з\n' +
    '        найвпливовіших ігор 8-бітної ери, надихнувши на створення пригодницьких ігор, таких як Metroid, та рольових\n' +
    '        ігор, таких як Final Fantasy. З того часу Zelda залишається найпродуктивнішою пригодницькою ігровою серією\n' +
    '        аж до сьогоднішнього дня.',
  fourth: 'Ігри жахів на виживання зосереджені на страху і намагаються налякати гравця за допомогою традиційних елементів\n' +
    '        фантастики жахів, таких як атмосфера, смерть, нежить, кров і кривава різанина. Одним з найважливіших елементів\n' +
    '        геймплею в багатьох з цих ігор є мала кількість боєприпасів або кількість зброї, що ламається в ближньому бою.\n' +
    '        Яскравими прикладами є Silent Hill та Resident Evil.',
  fifth: 'Першою грою в жанрі survival horror стала AX-2: Uchuu Yusousen Nostromo (яп. ＡＸ-２ 宇宙輸送船ノストロモ), розроблена\n' +
    '        Акірою Такігучі, студентом Токійського університету та підрядником Taito, для PET 2001. Вона була перенесена на\n' +
    '        PC-6001 Масакуні Міцухаші (також відомий як Хіромі Оба, пізніше приєднався до Game Arts) і опублікована ASCII в\n' +
    '        1981 році, ексклюзивно для Японії.',
  sixth: 'Ігри в жанрі метроїдванія - це піджанр платформерів, названий на честь двох перших відомих франшиз, Metroid і\n' +
    '        Castlevania. Вони мають великі взаємопов\'язані карти світу, які гравець може досліджувати, але доступ до частин\n' +
    '        світу обмежений дверима або іншими перешкодами, які можна відкрити лише після того, як гравець придбає\n' +
    '        спеціальні інструменти, зброю або здібності в межах гри. Здобуття таких поліпшень також допомагає гравцеві\n' +
    '        перемагати складніших ворогів і знаходити короткі шляхи та таємні місця, а також часто включає повторення своїх\n' +
    '        кроків по карті. Метроїдвані зазвичай не мають лінійного ігрового процесу і часто передбачають багато\n' +
    '        ретроспекцій - особливо після отримання нових здібностей чи інструментів.'
}

export const survivalHorror = [
  {src: ax2, title: 'AX-2: Uchuu Yusousen Nostromo'},
  {src: silentHill, title: 'Silent Hill'},
];

export const metroidvania = [
  {src: metroid, title: 'Metroid'},
  {src: castelvania, title: 'Castelvania'},
]