import broforce from '../../assets/genres/actions/broforce.png';
import donkeykong from '../../assets/genres/actions/donkeykong.png';

import doom from '../../assets/genres/actions/doom.png';
import halflife from '../../assets/genres/actions/halflife.jpg';

import valorant from '../../assets/genres/actions/valorant.gif';
import apex from '../../assets/genres/actions/apex.gif';
import overwatch from '../../assets/genres/actions/overwatch.gif';

import mortalCombat from '../../assets/genres/actions/mortalcombat.webp';
import streetFighter from '../../assets/genres/actions/street_fighters.avif';
import superSmash from '../../assets/genres/actions/super_smash.webp';

import manbiki from '../../assets/genres/actions/manbiki.jpg';
import metalGear from '../../assets/genres/actions/metalgear.webp';

import rust from '../../assets/genres/actions/rust.jpg';
import raft from '../../assets/genres/actions/raft.jpg';

import stepMania from '../../assets/genres/actions/stepmania.jpg';
import guitarHero from '../../assets/genres/actions/Guitar-Hero-Slash.webp';
import danceDanceRevolution from '../../assets/genres/actions/dance-dance-revolution-game.jpg';

import pubg from '../../assets/genres/actions/pubg.gif';
import fortnite from '../../assets/genres/actions/fortnite.gif';
import warzone from '../../assets/genres/actions/warzone.gif';


export const actionParagraphs = {
  first: 'Екшн-ігри - це жанр, який зосереджений на швидкій, інтенсивній та адреналіновій дії. Ці ігри вимагають\n' +
    '        від гравців хороших реакцій та координації рухів.Більшість ранніх відеоігор вважалися екшенами; сьогодні це все\n' +
    '        ще широкий жанр, що охоплює всі ігри, які передбачають фізичні випробування.',
  second: 'Екшн-ігри класифікуються за багатьма піджанрами. Платформні ігри та файтинги є одними з найвідоміших піджанрів,\n' +
    '        тоді як шутер став і продовжує залишатися одним з домінуючих жанрів у відеоіграх з 1990-х.',
  third: 'Платформні ігри (або платформери) мають ігровий процес, що в основному зосереджений на стрибках і лазінні для\n' +
    '        переміщення гравця по середовищу. У них можуть бути вороги або перешкоди, яких потрібно уникати і з якими\n' +
    '        потрібно боротися, або ж це можуть бути просто стрибкові головоломки. Як правило, персонажі в платформерних\n' +
    '        іграх здатні стрибати у багато разів вище власного зросту, і гравцеві пропонується певний контроль над їхнім\n' +
    '        пересуванням у повітрі, а також над висотою та відстанню стрибків. Налаштування, як правило, перебільшені по\n' +
    '        вертикалі з великою кількістю нерівностей, на які гравець може стрибати або падати.',
  fourth: 'Donkey Kong (1981) був одним з найперших і найвідоміших платформерів; американська ігрова преса класифікувала\n' +
    '        його, використовуючи термін "гра для скелелазіння". Super Mario Bros. (1985), платформер, був однією з\n' +
    '        найбільш продаваних ігор усіх часів, з більш ніж 40 мільйонами проданих копій.',
  fifth: 'У іграх-шутерах (або просто шутерах) гравці використовують далекобійну зброю для участі в дії, яка відбувається\n' +
    '        на відстані. Більшість шутерів передбачають жорстокий геймплей; летальна зброя використовується для завдання\n' +
    '        шкоди супротивникам.',
  sixth: 'Окрім класифікації за піджанрами, шутери можна також класифікувати за перспективою гри. У шутерах від першої\n' +
    '        особи гра ведеться від імені протагоніста; вони часто включають в себе екран, на якому відображається ключова\n' +
    '        інформація, наприклад, поточний стан здоров\'я протагоніста У шутерах від третьої особи тіло протагоніста\n' +
    '        видно повністю, а навколишнє середовище зображується здалеку. Деякі шутери включають обидві перспективи.',
  seventh: 'Героїчні шутери - це багатокористувацькі шутери від першої або третьої особи, в яких акцент робиться на\n' +
    '        заздалегідь розроблених персонажах-героях, кожен з яких володіє особливими здібностями та/або зброєю,\n' +
    '        притаманними тільки йому. Героїчні шутери всіляко заохочують командну роботу між гравцями в команді, допомагаючи\n' +
    '        гравцям вибирати ефективні комбінації персонажів-героїв і координувати використання здібностей героїв під час\n' +
    '        матчу. Поза грою гравці мають можливість налаштовувати зовнішній вигляд героїв, але без жодних інших ігрових\n' +
    '        ефектів. Героїчні шутери натхненні жанром багатокористувацьких онлайн-боїв на арені та популярними командними\n' +
    '        шутерами, такими як Team Fortress 2. Прикладами героїчних шутерів є Overwatch, Paladins, Apex Legends та\n' +
    '        Valorant.',
  eighth: 'Починаючи з 1990-х років, шутери, особливо від першої особи, набули широкого успіху у відеоіграх, на них\n' +
    '        припадає великий відсоток продажів відеоігор. Wolfenstein 3D, створений Id Software і випущений у 1992 році,\n' +
    '        вважається новаторським геймплеєм і графічними елементами, які були використані багатьма іншими шутерами.\n' +
    '        Також розроблена Id і опублікована через рік після виходу Wolfenstein 3D, Doom вважається однією з\n' +
    '        найвпливовіших ігор в історії відеоігор. Інші успішні серії шутерів включають Half-Life, широко відому і\n' +
    '        комерційно успішну серію, відому своїм впливом на сучасні шутери; і франшиза Call of Duty, з більш ніж 250\n' +
    '        мільйонами продажів всіх її ігор.',
  ninth: 'Файтинги зосереджені на ближньому бою, як правило, один на один або проти невеликої кількості однаково сильних\n' +
    '        супротивників, часто з жорстокими та перебільшеними неозброєними атаками. Більшість файтингів мають велику\n' +
    '        кількість ігрових персонажів і змагальний багатокористувацький режим. Хоча більшість файтингів роблять акцент на\n' +
    '        рукопашному бою, деякі файтинги, такі як Soulcalibur та Samurai Shodown, зосереджені на боях зі зброєю\n' +
    '        ближнього бою. Багато файтингів включають в себе атаки, засновані на різних системах бойових мистецтв. Файтинги\n' +
    '        були одним з домінуючих жанрів у відеоіграх до кінця 1990-х років, коли цей жанр зазнав невеликого занепаду.\n' +
    '        Однак цей занепад був нетривалим, оскільки такі ігри, як Mortal Kombat, Street Fighter та Super Smash Bros.\n' +
    '        домінують у сучасній демографічній групі файтингів, хоча різні піджанри починають ставати все більш\n' +
    '        популярними. Super Smash Bros. та її відхилення від традиційного набору правил файтингу є однією з таких ігор,\n' +
    '        яка здобула велику кількість прихильників завдяки своєму менталітету розробки партійних ігор "задоволення\n' +
    '        переважає над формою".',
  tenth: 'Ці ігри, як правило, роблять акцент на крадіжці та уникненні уваги ворога, а не на прямому конфлікті, наприклад,\n' +
    '        серії Metal Gear та Sly Cooper. У стелс-іграх гравці, як правило, все ще можуть брати участь у гучних, помітних\n' +
    '        боях, але часто отримують за це покарання. В інших іграх, таких як Dishonored, гравець може досягти своєї мети\n' +
    '        зі стелсом або без нього, але стелс заохочується, оскільки гравець перебуває у невигідному становищі порівняно з\n' +
    '        багатьма ворогами. Включення стелсу як механіки в гру не обов\'язково робить її стелс-грою. Наприклад, у Skyrim є\n' +
    '        ціле дерево перків, присвячене "крадіжці", незважаючи на те, що більшість підземель у грі можна пройти,\n' +
    '        використовуючи стратегію "хак і слеш".',
  eleventh: 'Першою стелс-грою була Manbiki Shounen (Shoplifting Boy), опублікована в листопаді 1979 р. Гра для\n' +
    '        персональних комп\'ютерів PET 2001 була розроблена Хіроші Сузукі.',
  twelfth: 'Metal Gear Хідео Кодзіми стала першою масовою стелс-грою, в якій гравець починав гру без зброї, і була\n' +
    '        продана в США накладом понад мільйон копій. Metal Gear 2: Solid Snake розвинула стелс-геймплей своєї\n' +
    '        попередниці. Metal Gear і Metal Gear 2 вважаються першопрохідцями в механіці стелс. Metal Gear Solid,\n' +
    '        яка дебютувала на Токійській ігровій виставці 1996 року, стала першою 3D-грою в жанрі стелс, і\n' +
    '        вважається популяризатором жанру стелс, а також механіки ховання за кришкою.',
  thirteen: 'Ігри на виживання починаються з мінімальними ресурсами, у ворожому, відкритому середовищі, і вимагають від\n' +
    '        гравця збирати ресурси, майструвати інструменти, зброю та укриття, щоб вижити якомога довше. Багато з них\n' +
    '        відбуваються у процедурно створених середовищах і є відкритими, без визначених цілей. Вони можуть перетинатися з\n' +
    '        жанром survival horror, в якому гравець повинен вижити в надприродних умовах, таких як зомбі-апокаліпсис.',
  fourteen: 'Ритм-гра або ритм-екшен - це жанр музичних відеоігор, що кидає виклик почуттю ритму гравця. До цього жанру\n' +
    '        належать танцювальні ігри, такі як Dance Dance Revolution, та музичні ігри, такі як Rock Band та Guitar Hero.\n' +
    '        Ігри цього жанру вимагають від гравця натискання кнопок у точний час: на екрані показується, яку кнопку потрібно\n' +
    '        натиснути, і гра нараховує бали як за точність, так і за синхронізацію з ритмом.',
  fifteen: 'PaRappa the Rapper вважається першою впливовою ритм-грою; її базовий шаблон ліг в основу\n' +
    '        наступних ігор у цьому жанрі. Серед інших популярних ритм-ігор - Dance Dance Revolution, Maimai, Project Diva,\n' +
    '        Cytus, Love Live: School Idol Festival, The Idolmaster, osu!, Taiko no Tatsujin, Crypt of the Necrodancer та\n' +
    '        інші.',
  sixteen: 'Королівська битва - це жанр, який поєднує в собі елементи виживання, дослідження та збирання сміття з геймплеєм\n' +
    '        останнього, хто залишився в живих. Королівські битви кидають виклик великій кількості гравців, які, починаючи з\n' +
    '        мінімального спорядження, шукають зброю та обладунки і знищують інших супротивників, намагаючись залишитися в\n' +
    '        безпечній ігровій зоні, яка зменшується з плином часу, а переможцем стає останній учасник у грі. Серед відомих\n' +
    '        королівських ігор - PlayerUnknown\'s Battlegrounds, Fortnite Battle Royale, Garena Free Fire, Apex Legends та\n' +
    '        Call of Duty: Warzone, кожна з яких отримала десятки мільйонів гравців протягом декількох місяців після виходу.',
}

export const platformGames = [
  {src: broforce, title: 'BroForce'},
  {src: donkeykong, title: 'Donkey Kong'},
];

export const shooterOldGames = [
  {src: doom, title: 'Doom'},
  {src: halflife, title: 'Half-Life'},
];

export const shooterGames = [
  {src: overwatch, title: 'Overwatch'},
  {src: apex, title: 'Apex Legends'},
  {src: valorant, title: 'Valorant'},
];

export const fightingGames = [
  {src: mortalCombat, title: 'Mortal Combat'},
  {src: streetFighter, title: 'Street Fighter'},
  {src: superSmash, title: 'Super Smash Bros.'},
];

export const stealthGames = [
  {src: manbiki, title: 'Manbiki Shounen'},
  {src: metalGear, title: 'Metal Gear'},
];

export const survivalGames = [
  {src: rust, title: 'Rust'},
  {src: raft, title: 'Raft'},
];

export const rhythmGames = [
  {src: stepMania, title: 'StepMania'},
  {src: guitarHero, title: 'Guitar Hero'},
  {src: danceDanceRevolution, title: 'Dance Dance Revolution'},
];

export const battleRoyale = [
  {src: pubg, title: 'PlayerUnknown\'s Battlegrounds'},
  {src: fortnite, title: 'Fortnite Battle Royale'},
  {src: warzone, title: 'Call of Duty: Warzone'},
]



