import colossal from '../../assets/genres/adventure/colossal.webp';
import myst from '../../assets/genres/adventure/myst.gif';
import longestJourney from '../../assets/genres/adventure/longest_journey.jpg';

import zork from '../../assets/genres/adventure/zork.jpg';
import aiDungeon from '../../assets/genres/adventure/ai_dungeon.jpg';

import mysteryHouse from '../../assets/genres/adventure/mystery_house.webp';
import sandsOfEgypt from '../../assets/genres/adventure/sands_of_egypt.png';

import aceAttorney from '../../assets/genres/adventure/ace_attorney.jpg';
import professorLayton from '../../assets/genres/adventure/professor_layton.jpg';

import residentEvil from '../../assets/genres/adventure/resident_evil.jpg';
import detroit from '../../assets/genres/adventure/detroit.jpg';

import shenmue from '../../assets/genres/adventure/shenmue.gif';
import shadowOfMemories from '../../assets/genres/adventure/shadow_of_memory.jpg';

export const adventuresParagraph = {
  first: 'Пригодницькі ігри були одними з перших створених ігор, починаючи з текстової пригоди Colossal Cave Adventure у\n' +
    '        1970-х роках. Ця гра спочатку називалася просто "Пригода" і є тезкою жанру. Згодом у жанрі з\'явилася графіка, а\n' +
    '        інтерфейс еволюціонував.',
  second: 'На відміну від пригодницьких фільмів, пригодницькі ігри не визначаються сюжетом чи змістом. Скоріше, пригода\n' +
    '        описує манеру гри без рефлекторних викликів або дій. Зазвичай вони вимагають від гравця вирішувати різноманітні\n' +
    '        головоломки, взаємодіючи з людьми або навколишнім середовищем, найчастіше у неконфронтаційний спосіб. Вважається\n' +
    '        "пуристичним" жанром і має тенденцію виключати все, що включає елементи екшену за межами міні-гри.',
  third: 'Оскільки вони не чинять особливого тиску на гравця у вигляді викликів, заснованих на дії, або часових обмежень,\n' +
    '        пригодницькі ігри мали унікальну здатність приваблювати людей, які зазвичай не грають у відеоігри. Пік\n' +
    '        популярності жанру пригодницьких ігор припав на 1993 рік, коли вийшла гра Myst, яка до того часу була найбільш\n' +
    '        продаваною комп\'ютерною грою всіх часів і народів. Простий інтерфейс, деталізовані світи та невимушений темп\n' +
    '        зробили її доступною, а відчуття художнього сюрреалізму змусило такі видання, як Wired Magazine, The New York\n' +
    '        Times та San Francisco Chronicle, заявити, що ігрова індустрія досягла зрілості. У гри з\'явилося чотири\n' +
    '        повноцінних сиквели, але жодному з них не вдалося досягти такого ж успіху. Успіх Myst також надихнув багатьох\n' +
    '        інших на створення подібних ігор з видом від першої особи, сюрреалістичним оточенням і мінімальним діалогом або\n' +
    '        взагалі без нього, але вони не змогли повторити успіх ні Myst, ні попередніх особистісно-орієнтованих пригод.',
  fourth: 'Наприкінці 1990-х жанр зазнав значного падіння популярності, масові релізи стали рідкісними, і багато хто\n' +
    '        оголосив пригодницьку гру мертвою. Точніше, вона стала нішевим жанром. Пригодницькі ігри не така вже й рідкість,\n' +
    '        але вони, як правило, дуже малобюджетні в розрахунку на скромні продажі. Жанр дещо омолодився з виходом гри The\n' +
    '        Longest Journey у 1999 році, яка зробила акцент на сильніших сюжетних елементах і більшій взаємодії з різними\n' +
    '        персонажами. Нещодавнє відродження пригодницьких ігор на консолях Nintendo може свідчити про новий інтерес до\n' +
    '        жанру. Успішна кампанія на Kickstarter у 2012 році, проведена студією Doublefine Studios, також свідчить про\n' +
    '        постійний інтерес до пригодницьких ігор. Гра, створена в результаті, загрузла в суперечках і затримках з\n' +
    '        виробництвом, а для декого означала справжній кінець жанру за межами нішевих ринків.',
  fifth: 'Найперші пригодницькі ігри були текстовими пригодами, також відомими як інтерактивна фантастика. Такі ігри, як\n' +
    '        популярна серія Zork кінця 1970-х - початку 1980-х років, дозволяли гравцеві використовувати клавіатуру для\n' +
    '        введення команд, таких як "дістати мотузку" або "йти на захід", в той час як комп\'ютер описував те, що\n' +
    '        відбувається. Значна частина програмування була спрямована на розбір тексту, який вводив гравець.',
  sixth: 'Пригодницькі ігри з\'явилися, коли графіка стала більш поширеною. Пригодницькі ігри почали доповнювати, а згодом\n' +
    '        і замінювати текстові описи візуальними зображеннями (наприклад, зображенням поточної локації). Ранні графічні\n' +
    '        пригодницькі ігри використовували текстові аналізатори для введення команд. Зростаюче використання миші призвело\n' +
    '        до появи пригодницького жанру "point-and-click", в якому гравцеві більше не потрібно було вводити команди.\n' +
    '        Наприклад, гравець міг натиснути на іконку руки, а потім на мотузку, щоб підняти мотузку.',
  seventh: 'Візуальний роман (яп. ビジュアルノベル, bijuaru noberu) - це гра з переважно статичною графікою, зазвичай у стилі аніме.\n' +
    '        Як можна здогадатися з назви, вони нагадують змішані медіа-романи або сценічні п\'єси типу tableau vivant. Багато\n' +
    '        візуальних романів відстежують статистику, яку гравець повинен будувати для просування сюжету, і допускають\n' +
    '        різноманітні кінцівки, дозволяючи більш динамічну реакцію на дії гравця, ніж типовий лінійний пригодницький\n' +
    '        сюжет. Багато візуальних романів - це симулятори побачень, включно з іграми бішодзьо. Візуальні романи особливо\n' +
    '        поширені в Японії, де вони становлять майже 70% випущених ігор для ПК. Їх рідко випускають для ігрових\n' +
    '        консолей, але найпопулярніші ігри іноді портують на такі системи, як Dreamcast або PlayStation 2. Ринок\n' +
    '        візуальних романів за межами Японії, однак, майже не існував до успіху Nintendo DS, для якої на Заході було\n' +
    '        випущено кілька японських візуальних романів, таких як серія Ace Attorney.',
  eighth: 'Жанр інтерактивного кіно з\'явився з винаходом лазерних дисків. Інтерактивний фільм містить заздалегідь відзняті\n' +
    '        повнометражні мультфільми або живі послідовності, де гравець контролює деякі рухи головного героя. Наприклад, у\n' +
    '        разі небезпеки гравець вирішує, який хід, дію чи комбінацію вибрати. У цих іграх єдина активність гравця полягає\n' +
    '        в тому, щоб вибрати або вгадати хід, який за задумом дизайнерів він має зробити. Інтерактивні фільми зазвичай\n' +
    '        відрізняються від ігор, які просто використовують повнометражне відео (FMV), що широко використовується між\n' +
    '        сценами, тим, що вони намагаються інтегрувати його в сам ігровий процес. Це використовується у всьому, від\n' +
    '        гоночних ігор до файтингів. Деякі пригодницькі ігри намагалися використовувати цей термін, щоб уподібнити сюжет\n' +
    '        своїх ігор до сюжетів фільмів, особливо пізні ігри Текса Мерфі та нещодавня Fahrenheit (Пророцтво Індіго),[38]\n' +
    '        хоча їх правильніше класифікувати як жанрові гібриди. Елементи інтерактивних фільмів були адаптовані для ігрових\n' +
    '        сцен у вигляді Quick Time Events, щоб тримати гравця напоготові. Такі ігри, як Resident Evil 4, містять очевидні\n' +
    '        ігрові підказки, на які гравець повинен реагувати. Якщо цього не зробити, персонаж гравця може бути поранений\n' +
    '        або й просто вбитий.',
  ninth: 'Приблизно в цей час з\'явилися пригодницькі 3D-ігри в реальному часі. Серед них Nightfall у 1998 році, Shenmue у\n' +
    '        1999 році, realMyst у 2000 році, Shadow of Memories у 2001 році, Uru: Ages Beyond Myst у 2003 році та франшиза\n' +
    '        Yakuza у 2005 році. Вони доповнили традиційний пригодницький геймплей деякими атрибутами, які частіше\n' +
    '        асоціюються з екшен-іграми, наприклад, свободою рухів і поведінкою, заснованою на фізиці.'
};

export const adventureGames = [
  {src: colossal, title: 'Colossal Cave Adventure'},
  {src: myst, title: 'Myst'},
  {src: longestJourney, title: 'The Longest Journey'},
];

export const textAdventure = [
  {src: zork, title: 'Zork'},
  {src: aiDungeon, title: 'AI Dungeon'},
];

export const graphicAdventure = [
  {src: mysteryHouse, title: 'Mystery House'},
  {src: sandsOfEgypt, title: 'Sands of Egypt'},
];

export const visualNovels = [
  {src: aceAttorney, title: 'Ace Attorney'},
  {src: professorLayton, title: 'Professor Layton'},
];

export const interactiveMovie = [
  {src: residentEvil, title: 'Resident Evil'},
  {src: detroit, title: 'Detroit: Become Human'},
];

export const realTime3DAdventures = [
  {src: shenmue, title: 'Shenmue'},
  {src: shadowOfMemories, title: 'Shadow of Memories'},
]