export const mmoParagraph = {
  first: 'Масова багатокористувацька онлайн-гра (також звана MMO і MMOG) - це багатокористувацька онлайн-відеогра, яка\n' +
    '        здатна підтримувати велику кількість гравців одночасно. В них обов\'язково грають в Інтернеті. Багато ігор мають\n' +
    '        принаймні один постійний світ, проте інші просто мають велику кількість гравців, які змагаються одночасно в тій\n' +
    '        чи іншій формі без будь-якого тривалого впливу на світ взагалі. Такі ігри можна знайти для більшості мережевих\n' +
    '        платформ, включаючи персональні комп\'ютери, відеоігрові консолі, смартфони та інші мобільні пристрої. Прикладом\n' +
    '        може слугувати широко розповсюджена гра Minecraft, в яку можна грати як в MMO, так і в однокористувацьку гру.',
  second: 'MMO-ігри дозволяють гравцям співпрацювати та змагатися один з одним у великих масштабах, а іноді й змістовно\n' +
    '        взаємодіяти з людьми по всьому світу. Вони включають різноманітні типи геймплея, що представляють багато жанрів\n' +
    '        відеоігор, таких як MMORPG, MMOFPS, MMORTS, MMOTBS та MMO симулятори.',
}