import arkanoid from '../../assets/genres/puzzle/arkanoid.jpg';
import breakout from '../../assets/genres/puzzle/breakout.webp';

import portal from '../../assets/genres/puzzle/portal.jpg';
import cutTheRope from '../../assets/genres/puzzle/cut_the_rope.jpg';
import worldOfGoo from '../../assets/genres/puzzle/world_of_goo.webp';

import limbo from '../../assets/genres/puzzle/limbo.jpg';
import dig from '../../assets/genres/puzzle/dig.jpg';
import monumentValley from '../../assets/genres/puzzle/monumentValley.webp';

import tetris from '../../assets/genres/puzzle/tetris.png';
import candyCrashSaga from '../../assets/genres/puzzle/candyCrushSaga.jpg';
import zuma from '../../assets/genres/puzzle/zuma.jpg';

import doki from '../../assets/genres/puzzle/doki.jpg';
import door from '../../assets/genres/puzzle/door_door.gif';

export const puzzleParagraph = {
  first: 'Головоломки - для тих, хто любить застосовувати свій мозок і знаходить задоволення у вирішенні головоломок. Чи\n' +
    '        то прості адаптації реальних головоломок, як-от судоку, чи повноцінні ігри-головоломки, призначені для вивчення\n' +
    '        у відеоігровому середовищі, - існує велика кількість різноманітних ігор. Вони перевіряють навички гравця\n' +
    '        вирішувати проблеми, включаючи логіку, розпізнавання образів, встановлення послідовності та завершення слів.\n' +
    '        Головоломки продовжують знаходити мільйони шанувальників, особливо на мобільних телефонах, де такі ігри, як\n' +
    '        Candy Crush Saga, надзвичайно популярні.',
  second: 'Головоломки зосереджені на логічних та концептуальних завданнях. Хоча багато екшенів та пригодницьких ігор\n' +
    '        включають елементи головоломки в дизайн рівнів, справжня гра-головоломка зосереджена на вирішенні головоломок як\n' +
    '        основній ігровій активності.',
  third: 'Замість того, щоб представляти випадковий набір головоломок для вирішення, ігри-головоломки зазвичай пропонують\n' +
    '        серію пов\'язаних між собою головоломок, які є варіаціями на одну тему. Ця тема може стосуватися розпізнавання\n' +
    '        образів, логіки чи розуміння процесів. Ці ігри зазвичай мають набір правил, за якими гравці маніпулюють ігровими\n' +
    '        фігурами в сітці, мережі або іншому просторі взаємодії. Гравці повинні розгадати підказки, щоб досягти певної\n' +
    '        умови перемоги, яка дозволить їм перейти на наступний рівень. Виконання кожної головоломки зазвичай призводить\n' +
    '        до більш складного завдання.',
  fourth: 'Клондайк (також відомий як блок-брейкінг або ball-and-paddle) - це підклас жанру головоломки. Цей жанр отримав\n' +
    '        свою назву за динаміку керованого гравцем блоку (так званого "весла"), на якому ґрунтується гра, що б\'є кулькою\n' +
    '        по різних об\'єктах, таких як кольорові плитки, спеціальні плитки та незруйновні плитки (так звані "цеглини").\n' +
    '        Термін "брікбастер" з\'явився на початку 2000-х років і здебільшого відноситься до більш сучасних ігор. Одними з\n' +
    '        перших прикладів є Arkanoid, розроблений Taito у 1986 році, та оригінальна Breakout, розроблена Atari у 1976\n' +
    '        році.',
  fifth: 'Логічні ігри-головоломки демонструють логіку та механізми, які є послідовними протягом всієї гри. Розв\'язання їх\n' +
    '        зазвичай вимагає навичок дедуктивного мислення.',
  sixth: 'Фізична гра - це тип логічної відеоігри-головоломки, де гравець повинен використовувати фізику та навколишнє\n' +
    '        середовище гри, щоб завершити кожну головоломку. Фізичні ігри використовують послідовну фізику, щоб зробити ігри\n' +
    '        більш складними. Цей жанр особливо популярний в онлайн-флеш-іграх та мобільних іграх. Освітяни\n' +
    '        використовують ці ігри для демонстрації принципів фізики.',
  seventh: 'Серед популярних логічних головоломок на основі фізики - Portal, The Talos Principle, The Witness, Braid, Fez, World of Goo та Cut the Rope.\n' +
    '\n' +
    'До них також належать ігри на зіткнення снарядів, такі як Angry Birds, Peggle, Monster Strike і Crush the Castle.',
  eighth: 'Це логічні ігри-головоломки, які вимагають елементів програмування. Прикладами є "Неймовірна машина",\n' +
    '        "SpaceChem" та "Infinifactory".',
  ninth: 'Цей піджанр включає в себе ігри типу "знайди і клацни", які часто мають схожість з пригодницькими іграми та\n' +
    '        симуляторами ходьби. На відміну від логічних головоломок, ці ігри зазвичай вимагають індуктивних міркувань для\n' +
    '        вирішення. Визначальною рисою є те, що гравець повинен експериментувати з механізмами на кожному рівні, перш ніж\n' +
    '        зможе їх розв\'язати. Елементи головоломки часто не мають послідовності впродовж гри, а отже, вимагають здогадок\n' +
    '        і перевірок, а також дослідження, щоб розкрити більше деталей головоломки. До таких ігор належать Myst, Limbo,\n' +
    '        The Dig, Monument Valley та квест-кімнати, такі як The Room.',
  tenth: 'Гра з прихованими об\'єктами (іноді її називають прихованою картинкою або головоломкою з прихованими об\'єктами\n' +
    '        (HOPA)) - це жанр відеоігор-головоломок, в яких гравець повинен знайти предмети зі списку, заховані в межах\n' +
    '        сцени. Ігри з прихованими об\'єктами є популярним трендом у казуальних іграх, і вони порівняно\n' +
    '        недорогі у придбанні. Файли таємничих справ: Huntsville, випущена Big Fish Games у 2005 році, вважається\n' +
    '        першою сучасною грою з прихованими об\'єктами, що з\'явилася на злеті казуальних ігор у середині 2000-х років.',
  eleventh: 'Гра "Відкрий картинку" - це тип гри-головоломки, яка полягає в тому, що ви по частинах відкриваєте фотографію\n' +
    '        або картинку.',
  twelfth: 'У відеоіграх, що зіставляють плитки, гравець маніпулює плитками, щоб змусити їх зникнути відповідно до критерію\n' +
    '        зіставлення. Цей жанр розпочався з 1985 року в грі Chain Shot! і має схожість з іграми з падаючими блоками,\n' +
    '        такими як Тетріс. До цього жанру належать ігри, в яких потрібно міняти місцями фігури, такі як Bejeweled або\n' +
    '        Candy Crush Saga, ігри, що адаптують класичну гру Маджонг на основі плиток, такі як Mahjong Trails, а також\n' +
    '        ігри, в яких фігури стріляють по дошці, такі як Zuma. У багатьох сучасних іграх на зіставлення плиток критерієм\n' +
    '        зіставлення є розміщення заданої кількості плиток одного типу так, щоб вони прилягали одна до одної. Ця\n' +
    '        кількість часто дорівнює трьом, і відповідна підмножина ігор на зіставлення плиток називається "ігри на\n' +
    '        зіставлення трьох плиток". Інші приклади включають "Трійки" та "Люміни".',
  thirteen: 'Існує також багато цифрових адаптацій традиційних ігор-головоломок, зокрема пасьянсів і маджонгів. Навіть\n' +
    '        знайомі нам головоломки зі словами, числами та асоціаціями були адаптовані у вигляді ігор, таких як "Тренування\n' +
    '        мозку доктора Кавашима".',
  fourteen: 'Головоломки-платформери характеризуються використанням ігрової структури платформи для управління грою, завдання\n' +
    '        якої в першу чергу пов\'язане з головоломками.',
  fifteen: 'Enix\'s Door Door 1983 року і Sega\'s Doki Doki Penguin Land 1985 року (для SG-1000) є, мабуть, першими\n' +
    '        прикладами, хоча жанр різноманітний, і класифікації можуть відрізнятися. Doki Doki Penguin Land дозволяла\n' +
    '        гравцям бігати і стрибати в типовому для платформників стилі, але вони також могли руйнувати блоки, і їх\n' +
    '        завданням було провести яйце до кінця рівня, не давши йому розбитися.',
  sixteen: 'The Lost Vikings (1993) була популярною грою в цьому жанрі. У ній є три персонажі, між якими гравці можуть\n' +
    '        перемикатися, кожен з яких має різні здібності. Всі три персонажі необхідні для виконання цілей рівня.',
  seventeen: 'Wario Land 2 перенесла серію Wario в жанр головоломки, усунувши елемент смерті і додавши тимчасові травми, такі\n' +
    '        як розчавлювання або підпал, і спеціалізовані здібності',
}

export const breakoutClone = [
  {src: arkanoid, title: 'Arkanoid'},
  {src: breakout, title: 'Breakout'},
];

export const physicsGame = [
  {src: portal, title: 'Portal'},
  {src: cutTheRope, title: 'Cut the Rope'},
  {src: worldOfGoo, title: 'World of Goo'},
];

export const exploration = [
  {src: limbo, title: 'Limbo'},
  {src: dig, title: 'The Dig'},
  {src: monumentValley, title: 'Monument Valley'},
];

export const tileMatchingGame = [
  {src: tetris, title: 'Tetris'},
  {src: candyCrashSaga, title: 'Candy Crush Saga'},
  {src: zuma, title: 'Zuma'},
];

export const puzzlePlatformGame = [
  {src: doki, title: 'Sega\'s Doki Doki Penguin Land'},
  {src: door, title: 'Enix\'s Door Door'},
];



