export const rolePlayingParagraph = {
  first: 'Рольові відеоігри беруть свій геймплей з традиційних настільних рольових ігор, таких як Dungeons & Dragons. У\n' +
    '        більшості таких ігор гравець виступає в ролі персонажа, який зростає в силі та досвіді протягом гри. Долаючи\n' +
    '        складні випробування та/або перемагаючи монстрів, гравець отримує очки досвіду, які відображають прогрес\n' +
    '        персонажа в обраній професії або класі (наприклад, у рукопашному бою або магічних заклинаннях дальньої дії) і\n' +
    '        дозволяють гравцеві отримати нові здібності після досягнення певної кількості очок. Багато рольових ігор містять\n' +
    '        відкритий світ, відомий як потойбічний світ, який зазвичай населений монстрами, що дозволяє отримати доступ до\n' +
    '        більш важливих ігрових локацій, таких як міста, підземелля та замки. Оскільки поява доступних домашніх\n' +
    '        комп\'ютерів збіглася з популярністю рольових ігор на папері та олівці, цей жанр став одним з перших у відеоіграх\n' +
    '        і продовжує бути популярним і сьогодні. Ігрові елементи, що тісно асоціюються з рольовими іграми, такі як\n' +
    '        статистичний розвиток персонажа через набуття балів досвіду, були широко адаптовані до інших жанрів, таких як\n' +
    '        пригодницькі ігри. Хоча майже всі ранні представники жанру були покроковими іграми, багато сучасних рольових\n' +
    '        ігор розвиваються в реальному часі. Таким чином, жанр наслідував тенденцію стратегічних ігор переходити від\n' +
    '        покрокових до боїв у реальному часі. Перехід до бою в реальному часі почався з виходом Final Fantasy IV від\n' +
    '        Square (тепер Square Enix), першої гри, яка використовувала систему бою в реальному часі; за нею швидко\n' +
    '        послідували рольові ігри, що працюють у реальному часі, такі як серія Mana, Soul Blazer і Ultima VII. Хоча\n' +
    '        старіші покрокові системи все ще існують, наприклад, серія Golden Sun для Game Boy Advance, а також Pokémon.',
  second: 'Екшн-рольова гра або екшн-рольова гра (англ. actions RPG) - це тип рольових відеоігор, який включає в себе бій у\n' +
    '        реальному часі на противагу покроковим або меню, часто запозичуючи елементи з екшн-ігор або пригодницьких ігор.\n' +
    '        Деякі з перших рольових ігор в жанрі екшн були випущені компанією Nihon Falcom у 1980-х роках, наприклад, серії\n' +
    '        Dragon Slayer і Ys. Пізніше так звані "клони Diablo" також стали частиною цього жанру. Хоча точне визначення\n' +
    '        жанру варіюється, типова рольова гра в жанрі "екшн" має великий акцент на бою, часто спрощуючи або видаляючи\n' +
    '        небойові атрибути та статистику, а також вплив, який вони мають на розвиток персонажа. Крім того, бій завжди\n' +
    '        відбувається з використанням системи реального часу (звідси і "екшн"), яка покладається на здатність гравця\n' +
    '        виконувати певні дії зі швидкістю та точністю для визначення успіху, а не в основному використовує атрибути\n' +
    '        персонажа для визначення цього.',
  third: 'Масові багатокористувацькі рольові онлайн-ігри, або MMORPG, з\'явилися в середині та наприкінці 1990-х років як\n' +
    '        комерційний графічний варіант текстових MUD, що існували з 1978 року. За великим рахунком, MMORPG мають звичайні\n' +
    '        цілі рольових ігор - виконання квестів і зміцнення персонажа, але включають до сотні гравців, які взаємодіють\n' +
    '        один з одним в одному і тому ж постійному світі в реальному часі. Концепція масової багатокористувацької гри\n' +
    '        була швидко поєднана з іншими жанрами. Фентезійні MMORPG, такі як Final Fantasy XI, The Lord of the Rings\n' +
    '        Online: Shadows of Angmar і The Elder Scrolls Online, залишаються найпопулярнішим типом MMOG, причому\n' +
    '        найпопулярнішою "платною" грою є World of Warcraft, а найпопулярнішими "безкоштовними" іграми - RuneScape і\n' +
    '        TERA, проте з\'являються й інші типи MMORPG. Науково-фантастичні MMORPG, такі як Phantasy Star Online, займають\n' +
    '        меншу частину ринку, а найвідомішою є популярна космічна науково-фантастична гра EVE Online. До інших масових\n' +
    '        багатокористувацьких онлайн-ігор, які не мають традиційного сеттингу рольових ігор, належать Second Life та\n' +
    '        Ingress.',
  fourth: 'Піджанр відеоігор roguelike запозичив свою назву та елементи геймплею з комп\'ютерної гри 1980 року Rogue. На\n' +
    '        перший погляд, roguelike - це двовимірний квест у підземеллі з високим ступенем випадковості завдяки процедурній\n' +
    '        генерації, акценту на статистичному розвитку персонажів і використанню перманентної смерті. Хоча традиційно вони\n' +
    '        мають\n' +
    '        текстовий інтерфейс, багато таких ігор використовують графічні тайли для подолання обмежень набору символів.\n' +
    '        Новіші ігри, які відходять від традиційних елементів hack-and-slash, але в іншому зберігають процедурну\n' +
    '        генерацію та перманентну смерть, іноді називають "rogue-lites".',
  fifth: 'Піджанр тактичних рольових ігор в основному відноситься до ігор, які включають геймплей зі стратегічних ігор як\n' +
    '        альтернативу традиційним системам RPG. Як і стандартні RPG, гравець контролює обмежену партію і бореться з\n' +
    '        аналогічною кількістю ворогів, але цей жанр включає стратегічний геймплей, такий як тактичне переміщення по\n' +
    '        ізометричній сітці. Жанр бере свій початок в настільних рольових іграх, де кожен гравець має час для\n' +
    '        прийняття рішень щодо дій своїх персонажів.',
  sixth: 'Рольові ігри з пісочницею або рольові ігри з відкритим світом надають гравцеві велику свободу і зазвичай містять\n' +
    '        дещо більш відкритий світ (тобто гравець не обмежений єдиним шляхом, обмеженим скелями, парканами тощо).\n' +
    '        Пісочниці мають схожість з іншими іграми-пісочницями, такими як серія Grand Theft Auto, з великою кількістю\n' +
    '        інтерактивних неігрових персонажів, великою кількістю контенту і, як правило, одними з найбільших світів для\n' +
    '        дослідження та найдовшим ігровим часом серед усіх RPG через вражаючу кількість другорядного контенту, який не є\n' +
    '        критично важливим для основної сюжетної лінії гри. RPG-пісочниці часто намагаються імітувати цілий регіон свого\n' +
    '        сеттингу. Популярними прикладами цього піджанру є серія Dragon Slayer від Nihon Falcom, ранні ігри Dragon Quest\n' +
    '        від Chunsoft, Wasteland від Interplay Entertainment, серії SaGa і Mana від Squaresoft, System Shock 2 від\n' +
    '        Irrational Games і Looking Glass Studios, Deus Ex від Ion Storm, The Elder Scrolls і Fallout від Bethesda\n' +
    '        Softworks і Interplay Entertainment, Fable від Lionhead Studios, серія Gothic від Piranha Bytes і серія\n' +
    '        Xenoblade Chronicles від Monolith Soft.',
  seventh: 'Також відомий як DRPG (Dungeon RPG), цей піджанр складається з рольових ігор, де гравець веде партію шукачів\n' +
    '        пригод від першої особи через підземелля або лабіринт, як правило, в сітковому середовищі. Прикладами є\n' +
    '        вищезгадані серії Wizardry, Might and Magic та Bard\'s Tale; а також серії Etrian Odyssey та Elminage. Ігри цього\n' +
    '        типу також відомі як "блоббери", оскільки гравець переміщує всю партію по ігровому полю як єдине ціле, або\n' +
    '        "згусток".',
  eighth: 'Більшість "блоберів" є покроковими, але деякі ігри, такі як Dungeon Master, Legend of Grimrock та Eye of the\n' +
    '        Beholder, граються в реальному часі. У ранніх іграх цього жанру відсутня функція автоматичної мапи, що змушує\n' +
    '        гравців малювати власні мапи, щоб відстежувати свій прогрес. Поширеними є екологічні та просторові головоломки,\n' +
    '        тобто гравцям може знадобитися, наприклад, перемістити камінь в одній частині рівня, щоб відкрити ворота в іншій\n' +
    '        частині рівня.',
  ninth: 'Варіант формули рольової гри, де гравець набирає монстрів, щоб битися за них або разом з ними. Зібраних істот\n' +
    '        часто можна вирощувати або розводити, щоб створювати сильніших монстрів або збільшувати їхні здібності в бою.\n' +
    '        Прикладом гри про приборкувачів монстрів є Покемони.'
}