import simcity from '../../assets/genres/simulation/simcity.jpg';
import citiesSkyline from '../../assets/genres/simulation/cities_skyline.jpg';
import caesar from '../../assets/genres/simulation/caesasr.jpg';

import sims from '../../assets/genres/simulation/sims.jpg';
import simLife from '../../assets/genres/simulation/simlife.png';
import tamagotchi from '../../assets/genres/simulation/tamagotchi.jpg'

import formula from '../../assets/genres/simulation/formula.jpg';
import kerbal from '../../assets/genres/simulation/kerbal.jpg';
import nfs from '../../assets/genres/simulation/nfs.webp';

export const simulationsParagraph = {
  first: 'Імітаційні відеоігри - це різноманітна суперкатегорія ігор, які, як правило, призначені для точного моделювання\n' +
    '        аспектів реальної або вигаданої дійсності.',
  second: 'Симуляції будівництва та управління (або CMS) - це різновид симуляційних ігор, в яких гравці мають будувати,\n' +
    '        розширювати або управляти вигаданими громадами чи проектами з обмеженими ресурсами.',
  third: 'У містобудівних іграх гравець діє як загальний планувальник або лідер, щоб задовольнити потреби і бажання\n' +
    '        ігрових персонажів, ініціюючи структури для їжі, житла, охорони здоров\'я, духовної опіки, економічного зростання\n' +
    '        і т.д. Успіх досягається тоді, коли міський бюджет отримує зростаючий прибуток, а громадяни відчувають\n' +
    '        покращення якості життя у сфері житла, охорони здоров\'я та товарів. Хоча військовий розвиток часто включається,\n' +
    '        акцент робиться на економічній силі. Мабуть, найвідомішою грою цього типу є SimCity, яка мала великий вплив на\n' +
    '        пізніші містобудівні ігри, такі як Cities: Skylines. SimCity, однак, також належить до жанру God Games, оскільки\n' +
    '        вона дає гравцеві божественні здібності в маніпулюванні світом. Caesar був довготривалою серією в цьому жанрі, а\n' +
    '        оригінальна гра породила три сиквели.',
  fourth: 'Бізнес-симулятори, як правило, намагаються імітувати економіку або бізнес, при цьому гравець контролює економіку\n' +
    '        гри.\n' +
    '        Урядові симулятори (або "політичні ігри") включають в себе симуляцію політики, уряду або політики країни, але,\n' +
    '        як правило, виключають військові дії. Останнім часом ці типи ігор отримали назву "серйозні ігри".',
  fifth: 'Ігри-симулятори життя (або ігри зі штучним життям) передбачають проживання або керування одним чи кількома\n' +
    '        штучними життями. Симулятор життя може бути присвячений окремим людям та їхнім стосункам, або ж це може бути\n' +
    '        симуляція екосистеми.',
  sixth: 'Біологічні симулятори можуть дозволити гравцеві експериментувати з генетикою, виживанням або екосистемами, часто\n' +
    '        у формі освітнього пакету. Ранній приклад - SimLife, відносно недавній - Jurassic Park: Операція "Генезис" і\n' +
    '        "Спора". В інших освітніх симуляторах, таких як Wolf, гравець "проживає життя" окремої тварини у відносно\n' +
    '        реалістичний спосіб. Однак однією з найкращих ігор-симуляторів життя є Creatures, Creatures 2, Creatures 3, де\n' +
    '        гравець виводить покоління видів у надзвичайно деталізованій екосистемі.',
  seventh: 'На відміну від інших жанрів ігор, ігри про бога часто не мають визначеної мети, яка б дозволила гравцеві виграти\n' +
    '        гру. У центрі уваги божественної гри, як правило, контроль над життям людей - від мікроменеджменту сім\'ї до\n' +
    '        нагляду за розвитком цивілізації.',
  eighth: 'Симулятори вирощування домашніх тварин (або цифрових домашніх тварин) більше зосереджені на стосунках між\n' +
    '        гравцем та однією або кількома формами життя. Вони часто більш обмежені в масштабах, ніж інші біологічні\n' +
    '        симулятори. Сюди входять такі популярні приклади віртуальних домашніх тварин, як Тамагочі та серія Petz.',
  ninth: 'Соціальні симулятори будують свій ігровий процес на соціальній взаємодії між кількома штучними життями.\n' +
    '        Найвідомішим прикладом цього жанру є The Sims Уілла Райта. До цієї категорії належать також симулятори знайомств\n' +
    '        та романтичні симулятори.',
  tenth: 'Ігри-симулятори транспортних засобів - це жанр відеоігор, які намагаються надати гравцеві реалістичну\n' +
    '        інтерпретацію керування різними видами транспортних засобів.',
  eleventh: 'У авіасимуляторах гравцеві пропонується максимально реалістично керувати літальним апаратом, як правило,\n' +
    '        літаком. Бойові авіасимулятори - найпопулярніший піджанр симуляторів. Гравець керує літаком, імітуючи не лише\n' +
    '        сам процес польоту, але й бойові ситуації. Існують також цивільні авіасимулятори, які не мають бойового аспекту.',
  twelfth: 'Гоночні ігри зазвичай ставлять гравця на місце водія високопродуктивного транспортного засобу і вимагають від\n' +
    '        нього змагатися з іншими водіями, а іноді просто на час. Цей жанр ігор є одним з основних у світі комп\'ютерних\n' +
    '        ігор, і багато з найперших створених комп\'ютерних ігор були частиною цього жанру. Виникнувши наприкінці 1970-х\n' +
    '        років, цей жанр і сьогодні залишається дуже популярним і продовжує розширювати межі графіки та продуктивності.\n' +
    '        Ці ігри "зазвичай поділяються на категорії організованих перегонів та уявних перегонів". Симулятори\n' +
    '        організованих перегонів намагаються "відтворити досвід керування гоночним автомобілем або мотоциклом в існуючому\n' +
    '        класі перегонів: Indycar, NASCAR, Формула 1 і так далі". З іншого боку, уявні гоночні ігри включають "уявні\n' +
    '        ситуації, шалену їзду по містах, сільській місцевості або навіть у фантастичному середовищі". Ці "уявні" гоночні\n' +
    '        ігри іноді називають аркадними гоночними іграми, на відміну від їхніх більш реалістичних аналогів "гоночних\n' +
    '        симуляторів". До них належать Need For Speed, Crash Team Racing і Gran Turismo. Роллінгс і Адамс зазначають, що\n' +
    '        "гоночні ігри часто продаються в спортивній категорії", але "з точки зору дизайну, вони насправді належать до\n' +
    '        ... симуляторів транспортних засобів"',
  thirteen: 'Космічні симулятори польотів - це піджанр ігор, які передбачають пілотування космічного корабля. Космічні\n' +
    '        симулятори відрізняються від інших піджанрів і зазвичай не вважаються симуляторами, оскільки їхні імітовані\n' +
    '        об\'єкти не завжди існують і часто ігнорують закони фізики, за винятком таких ігор, як Orbiter і Kerbal Space\n' +
    '        Program.',
  fourteen: 'Залізничні симулятори імітують транспортні засоби, навколишнє середовище і часто економіку, пов\'язану із\n' +
    '        залізничним транспортом. Часто вони мають історичний характер, нагадуючи про еволюцію та появу залізниць у\n' +
    '        різних країнах та економічні буми, які часто супроводжували їх.',
  fifteen: 'Авто-бої або авто-бої зосереджені на швидкому розвитку подій, оскільки гравець керує автомобілем або іншим\n' +
    '        транспортним засобом і намагається вивести з ладу або знищити комп\'ютерних або людських супротивників.\n' +
    '        Автомобільні бої часто дозволяють гравцеві вибирати з безлічі потенційних транспортних засобів, кожен з яких має\n' +
    '        свої сильні та слабкі сторони. Автомобільний бій народився з гоночних/шутерних комбінацій, таких як Spy Hunter,\n' +
    '        RoadBlasters та Rock\'N\'Roll Racing, але відрізняється тим, що гравці можуть, за бажанням, відводити свої\n' +
    '        транспортні засоби з попередньо визначених маршрутів і вести бій там, де їм заманеться. Піджанром автомобільного\n' +
    '        бою є бій на мехах, де транспортні засоби, як правило, включають гігантські роботизовані танки.'
}

export const constructionManagement = [
  {src: simcity, title: 'SimCity'},
  {src: citiesSkyline, title: 'Cities: Skylines'},
  {src: caesar, title: 'Caesar'},
];

export const lifeSimulation = [
  {src: sims, title: 'The Sims'},
  {src: simLife, title: 'SimLife'},
  {src: tamagotchi, title: 'Tamagotchi'},
];

export const vehicleSimulation = [
  {src: nfs, title: 'Need for Speed'},
  {src: formula, title: 'Formula 1'},
  {src: kerbal, title: 'Kerbal Space Program'},
];


