export const sportsParagraph = {
  first: 'Спорт - це відеоігри, які імітують спортивні або аркадні види спорту. Командою (командами) суперників можуть\n' +
    '        керувати інші реальні люди або штучний інтелект.',
  second: 'Існують різні типи гоночних ігор, в яких гравець змагається з часом або суперниками, використовуючи певні засоби\n' +
    '        пересування. Піджанри включають гоночні симулятори (Gran Turismo) та картингові перегони (Mario Kart). Інші\n' +
    '        серії гоночних симуляторів, такі як Forza, є одними з найпопулярніших ігор у цій категорії, але аркадна класика,\n' +
    '        така як Pole Position, також включена сюди.',
  third: 'Спортивні ігри імітують традиційні фізичні види спорту. Деякі з них акцентують увагу на власне грі в спорт, інші\n' +
    '        - на стратегії, що стоїть за цим видом спорту (наприклад, "Менеджер чемпіонату"). Інші сатирично висміюють спорт\n' +
    '        задля комічного ефекту (наприклад, Arch Rivals). Однією з найбільш продаваних серій у цьому жанрі є серія FIFA.\n' +
    '        Цей жанр з\'явився на початку історії відеоігор (наприклад, Pong) і залишається популярним і сьогодні. Інші ігри,\n' +
    '        такі як NBA Jam, сатирично висміюють цей жанр, тоді як інші, такі як Madden NFL (серія) і NBA 2K (серія),\n' +
    '        прагнуть відтворити реалізм і передати відчуття гри в живий спорт.',
  fourth: 'Змагальні ігри - це ігри, які мають високий фактор конкуренції, але не представляють традиційні види спорту,\n' +
    '        наприклад, ігри, в яких концепція вигадана і розроблена розробником (наприклад, Ball Jacks і Rocket League).',
  fifth: 'Спортивні файтинги - це ігри, які чітко підпадають під визначення як жанру файтингу, так і спортивних ігор,\n' +
    '        наприклад, відеоігри з боксу та боротьби. Тому їх зазвичай виділяють у окремі піджанри. Часто бої набагато\n' +
    '        реалістичніші, ніж у традиційних файтингах (хоча ступінь реалістичності може сильно відрізнятися), і в багатьох\n' +
    '        з них є реальні франшизи або бійці. Прикладами цього є серії Fight Night, UFC та WWE 2K.',
}