export const strategiesParagraph = {
  first: 'Стратегічні відеоігри зосереджуються на ігровому процесі, що вимагає ретельного та вмілого мислення і планування\n' +
    '        для досягнення перемоги, а масштаби дій варіюються від світового панування до тактики на основі загону. "У\n' +
    '        більшості стратегічних відеоігор, - каже Ендрю Роллінгс, - гравцеві надається богоподібний погляд на ігровий\n' +
    '        світ, який опосередковано контролює юніти під його командуванням". Роллінгс також зазначає, що "походження\n' +
    '        стратегічних ігор сягає корінням у їхніх близьких родичів - настільні ігри"[54]. Стратегічні відеоігри, як\n' +
    '        правило, приймають одну з чотирьох архетипових форм, залежно від того, чи є гра покроковою, чи в реальному часі,\n' +
    '        а також від того, на чому зосереджено увагу в грі - на стратегії чи тактиці. Стратегічні ігри в реальному часі\n' +
    '        часто є іграми з вибором декількох юнітів (можна вибрати декількох ігрових персонажів одночасно для виконання\n' +
    '        різних завдань, на відміну від вибору лише одного персонажа за раз) з видом на небо (вид зверху вниз), але деякі\n' +
    '        останні ігри, такі як Tom Clancy\'s EndWar, є іграми з вибором одного юніта та видом від третьої особи. Як і\n' +
    '        багато рольових ігор, багато стратегічних ігор поступово відходять від покрокових систем до систем у реальному\n' +
    '        часі.',
  second: '4X відноситься до жанру стратегічних відеоігор з чотирма основними цілями: eXplore, eXpand, eXploit і\n' +
    '        eXterminate. Гра 4X може бути покроковою або в реальному часі. Мабуть, найвідомішим прикладом цього жанру є\n' +
    '        серія Sid Meier\'s Civilization. 4X-ігри часто охоплюють дуже великий проміжок часу, даючи гравцеві контроль над\n' +
    '        цілою цивілізацією або видом. Зазвичай ці ігри мають історичний сеттінг, що охоплює велику частину людської\n' +
    '        історії (Empire Earth, Civilization, Golden Age of Civilizations) або науково-фантастичний сеттінг, де гравець\n' +
    '        керує видом, який має домінувати в галактиці (Master of Orion, Galactic Civilizations).',
  third: 'Артилерія - це загальна назва ранніх комп\'ютерних ігор для двох або трьох гравців (зазвичай покрокових), в яких\n' +
    '        танки воюють один з одним у бою, або подібних похідних ігор. Артилерійські ігри були одними з перших розроблених\n' +
    '        комп\'ютерних ігор і можуть вважатися продовженням початкового використання комп\'ютерів, які колись\n' +
    '        використовувалися для військових розрахунків, таких як побудова траєкторій польотів ракет. Артилерійські ігри\n' +
    '        вважаються різновидом покрокових тактичних ігор, хоча їх також описують як різновид "ігор-стрілялок". Прикладами\n' +
    '        цього жанру є Pocket Tanks, Hogs of War, Scorched 3D та серія Worms.',
  fourth: 'Автобатлер, також відомий як "автошахи", - це тип стратегічної гри, що має шахові елементи, де гравці розміщують\n' +
    '        персонажів на полі бою у формі сітки під час фази підготовки, які потім борються з персонажами протилежної\n' +
    '        команди без будь-якого подальшого прямого втручання гравця. Він був створений і популяризований Dota Auto\n' +
    '        Chess на початку 2019 року, і незабаром після цього з\'явилося більше ігор у цьому жанрі від інших студій, таких\n' +
    '        як Teamfight Tactics, Dota Underlords, і Hearthstone Battlegrounds, що вийшли незабаром після цього.',
  fifth: 'Багатокористувацька онлайнова бойова арена (MOBA), також відома як Action RTS (ARTS) - це жанр стратегічних\n' +
    '        відеоігор, в якому кожен гравець контролює одного персонажа з набором унікальних здібностей, які покращуються\n' +
    '        протягом гри і які сприяють загальній стратегії команди. Гравці працюють разом як команда, щоб досягти умови\n' +
    '        перемоги, яка полягає в тому, щоб знищити основну структуру команди-суперника, захищаючи при цьому свою власну.\n' +
    '        Гравцям, яких зазвичай називають "героями" або "чемпіонами", допомагають керовані комп\'ютером юніти, які\n' +
    '        періодично з\'являються групами і рухаються вперед по заданих шляхах (так званих "доріжках") до бази противника.\n' +
    '        На заваді цьому стоять оборонні споруди, які зазвичай є автоматичними "вежами". Перша команда, яка знищить\n' +
    '        головну споруду супротивника, виграє матч[61]. Жанр розглядається як поєднання стратегічних ігор у реальному\n' +
    '        часі, рольових ігор та екшенів, однак гравці зазвичай не будують ані будівель, ані юнітів.',
  sixth: 'Цей тип багатокористувацьких онлайн-відеоігор набув популярності на початку 2010-х років: мод Defense of the\n' +
    '        Ancients для Warcraft III, League of Legends, Dota 2, Heroes of the Storm, Mobile Legends: Bang Bang та\n' +
    '        Smite. MOBA-ігри також добре представлені в кіберспорті. У 2018 році призові фонди сягнули понад\n' +
    '        60 мільйонів доларів США, що становить 40% від загальних призових фондів кіберспорту за рік.',
  seventh: 'Термін "стратегія в реальному часі" (RTS), який зазвичай застосовується лише до певних комп\'ютерних стратегічних\n' +
    '        ігор (проте цей жанр є, мабуть, найвідомішим серед стратегічних ігор і саме його мають на увазі більшість\n' +
    '        веб-сайтів, коли говорять "стратегічні ігри"), вказує на те, що дія в грі відбувається безперервно, і гравцям\n' +
    '        доведеться приймати свої рішення і дії на тлі постійно мінливого ігрового стану. Ігровий процес стратегії в\n' +
    '        реальному часі характеризується здобуттям ресурсів, будівництвом баз, дослідженням технологій та виробництвом\n' +
    '        юнітів. StarCraft від Blizzard Entertainment - популярна RTS, в яку грають на змаганнях у Південній Кореї і яку\n' +
    '        транслюють по телебаченню для великої аудиторії. Інші відомі ігри включають серію Warcraft, Age of Empires, Dawn\n' +
    '        of War, Company of Heroes, Command and Conquer і Dune II (по суті, перша RTS-гра). За межами ПК дуже мало\n' +
    '        стратегічних ігор працюють у реальному часі; кілька прикладів - Battle for Middle-earth II, Pikmin і Halo Wars.\n' +
    '        Ще менше використовують фізичні фігури, наприклад, Icehouse.',
  eighth: 'Тактика в реальному часі (скорочено RTT[67], рідше - "стратегія в реальному часі з фіксованими\n' +
    '        підрозділами") - це піджанр тактичних військових ігор, що граються в реальному часі, імітуючи міркування та\n' +
    '        обставини оперативної війни та військової тактики. Вона також іноді розглядається як піджанр стратегії в\n' +
    '        реальному часі, і тому в цьому контексті може існувати як елемент ігрового процесу або як основа для всієї гри.\n' +
    '        Від стратегій у реальному часі відрізняється відсутністю мікроменеджменту ресурсів та будівництва баз чи юнітів,\n' +
    '        а також більшою важливістю окремих юнітів та зосередженістю на складній тактиці ведення бою на полі бою.\n' +
    '        Приклади назв включають Warhammer: Dark Omen, World In Conflict, серія Close Combat та ранні тактичні рольові\n' +
    '        ігри, такі як Bokosuka Wars, Silver Ghost та First Queen.',
  ninth: 'Ігри про захист веж мають дуже просту схему. Зазвичай керовані комп\'ютером монстри рухаються по заданому шляху,\n' +
    '        а гравець повинен розміщувати або "будувати" вежі вздовж цього шляху, щоб вбивати ворогів. У деяких іграх вежі\n' +
    '        розміщуються вздовж заданого шляху для ворогів, тоді як в інших вежі можуть переривати рух ворогів і змінювати\n' +
    '        їхній шлях. У більшості ігор в жанрі "оборона веж" різні вежі мають різні можливості, наприклад, отруєння\n' +
    '        ворогів або уповільнення їхнього руху. За вбивство ворогів гравець отримує гроші, які можна використати на\n' +
    '        купівлю нових веж або на модернізацію вежі, наприклад, збільшення потужності або дальності дії.',
  tenth: 'Термін "покрокова стратегія" (англ. turn-based strategy, TBS) зазвичай використовується для позначення певних\n' +
    '        комп\'ютерних стратегічних ігор, щоб відрізнити їх від стратегічних ігор у реальному часі. У покрокових іграх\n' +
    '        гравцеві дозволяється проаналізувати ситуацію, перш ніж почати ігрову дію, а в деяких іграх дозволяється зробити\n' +
    '        певну кількість ходів або дій за один хід. Як і стратегічні ігри в реальному часі, цей жанр може включати багато\n' +
    '        стратегічних ігор, які не є виключно покроковими, а також ігри, які можуть містити інші особливості, не\n' +
    '        пов\'язані з тим, чи є гра покроковою чи ні. Прикладами цього жанру є Civilization, Heroes of Might and Magic,\n' +
    '        Making History та Master of Orion.',
  eleventh: 'Деякі нещодавні покрокові стратегічні ігри мають іншу механіку гри, з одночасним дозволом ходів, кожен гравець\n' +
    '        готує свої майбутні дії на етапі планування, а потім дозволяє грі виконувати накази, віддані в той самий час,\n' +
    '        змушуючи накази перериватися діями опонентів, змінюючи ігровий процес з реакції на дії опонента на їх\n' +
    '        вгадування.',
  twelfth: 'Ігровий процес покрокових тактичних ігор (ПТІ) характеризується очікуванням від гравців виконання поставлених\n' +
    '        завдань за допомогою наданих їм бойових сил і, як правило, реалістичним (або принаймні правдоподібним)\n' +
    '        відображенням військової тактики та операцій. Прикладами цього жанру є серії Wars, Jagged Alliance та X-COM, а\n' +
    '        також тактичні рольові ігри, такі як Fire Emblem та Final Fantasy Tactics.',
  thirteen: 'Військові ігри - це піджанр стратегічних відеоігор, в яких акцент робиться на стратегічній або тактичній війні\n' +
    '        на карті. Військові ігри зазвичай приймають одну з чотирьох архетипічних форм, залежно від того, чи гра\n' +
    '        покрокова, чи в реальному часі, а також від того, чи зосереджена гра на військовій стратегії чи тактиці.',
  fourteen: 'Стратегічна військова гра - це військова гра, в якій основна увага приділяється великій стратегії: військовій\n' +
    '        стратегії на рівні пересування та використання ресурсів цілої національної держави або імперії. Прикладом цього\n' +
    '        є франшиза Hearts of Iron.',
}