import {Typography} from "antd";

const {Title, Paragraph} = Typography;

const EnginesPage = () => {
  return (
    <Typography>
      <Title>Ігрові двигуни</Title>
      <Paragraph>
        "Ігрові двигуни" - це складне програмне забезпечення, яке використовується для розробки відеоігор. Ігровий рушій
        містить різноманітні модулі та бібліотеки, які дозволяють розробникам створювати графіку, звук, фізику, штучний
        інтелект та інші компоненти гри. Ігрові рушії розробляють великі компанії, такі як Epic Games, Unity
        Technologies, Crytek та інші.
      </Paragraph>
      <Paragraph>
        Одним з найпопулярніших ігрових рушіїв є Unreal Engine, розроблений компанією Epic Games. Unreal Engine містить
        багато можливостей, серед яких високоякісна графіка, різноманітні інструменти для роботи з фізикою та штучним
        інтелектом, а також механізми для розробки багатокористувацьких ігор. Unreal Engine використовується для
        створення таких відомих ігор, як Fortnite, Gears of War, Batman: Arkham Knight та інших.
      </Paragraph>
      <Paragraph>
        Ще одним відомим ігровим рушієм є Unity. Він дозволяє розробникам створювати ігри для різних платформ, включаючи
        мобільні, настільні комп'ютери, консолі та віртуальну реальність. Unity містить багато інструментів, які
        допомагають розробникам створювати якісні та захоплюючі ігри з якісною графікою та фізикою. Серед ігор,
        створених на основі Unity, - Cuphead, Ori and the Blind Forest, Hearthstone та інші.
      </Paragraph>
      <Paragraph>
        Серед інших відомих ігрових рушіїв - CryEngine, який використовується для створення серії ігор Crysis, та id
        Tech, який використовувався для створення серії ігор Doom та Quake.
      </Paragraph>
      <Paragraph>
        Ігрові рушії є важливими інструментами для розробки відеоігор, оскільки вони дозволяють розробникам створювати
        якісні та захоплюючі ігри з високоякісною графікою, фізикою та іншими ігровими компонентами. Використання
        ігрових рушіїв дозволяє розробникам зосередитися на творчому процесі та створенні якісних ігор замість того, щоб
        витрачати гроші на створення власних інструментів.
      </Paragraph>
      <Paragraph>
        Однією з переваг використання ігрових рушіїв є можливість створювати ігри для різних платформ за допомогою
        одного рушія. Це дозволяє розробникам ефективно використовувати свій час і зусилля при створенні ігор для різних
        платформ.
      </Paragraph>
      <Paragraph>
        Крім того, багато ігрових рушіїв мають активні спільноти розробників і користувачів, які допомагають один одному
        у вирішенні проблем і обмінюються досвідом.
      </Paragraph>
      <Paragraph>
        Ігрові рушії також дозволяють розробникам створювати ігри з високою інтерактивністю та динамікою. Це можливо
        завдяки використанню таких технологій, як фізичне моделювання та штучний інтелект.
      </Paragraph>
      <Paragraph>
        Таким чином, ігрові рушії є важливими інструментами для розробки відеоігор. Вони дозволяють розробникам
        створювати якісні та захоплюючі ігри з якісною графікою та фізикою, а також ефективно використовувати свій час
        та зусилля при створенні ігор для різних платформ. Багато відомих ігор були створені за допомогою таких рушіїв,
        як Unreal Engine, Unity, CryEngine та інших.
      </Paragraph>
    </Typography>
  );
};

export default EnginesPage;
