import {Collapse, Typography} from 'antd';
import {genresArray} from "../../data/genresArray.js";

const GenresPage = () => {
  const {Title, Paragraph} = Typography;
  const {Panel} = Collapse;

  return (
    <Typography>
      <Title>Жанри відеоігор</Title>
      <Paragraph>
        Жанри відеоігор - це категорії, які класифікують відеоігри на основі їх
        геймплею, стилю та механіки. Ці жанри можуть мати значний вплив на вибір
        гравців та їхні ігрові переживання. Різні жанри можуть задовольнити
        різні інтереси та вподобання, надаючи гравцям широкий спектр можливостей
        для розваги та взаємодії.
      </Paragraph>
      <Paragraph>
        Жанр відеоігор не залежить від сценарію або змісту умовно-уявного ігрового світу, на відміну від творів
        літературии кіномистецтва. Єдиної класифікації жанрів відеоігор не існує, тому в різних джерелах одну й ту саму
        відеогру можуть відносити до різних.
      </Paragraph>
      <Paragraph>
        Відеоігри також класифікують, окрім жанрів, також за кількістю та характером взаємодії гравців. Це можуть бути
        соло, два або більше на одному пристрої, мережеві у локальних обчислювальних мережах, мережеві в Інтернеті.
        Останні в режимах online або offline.
      </Paragraph>
      <Paragraph>
        Ранні спроби класифікації відеоігор стосувалися в основному організації каталогів і книг. У каталозі Atari VCS
        1981 року використовується 8 заголовків: Галерея навичок, Космічна станція, Класичний куточок, Територія пригод,
        Гоночна траса, Спортивна арена, Бойова зона та Навчальний центр. (Класика - це шахи та шашки).
      </Paragraph>
      <Paragraph>
        У книзі Тома Гіршфельда "Як опанувати відеоігри" 1981 року він поділяє ігри на широкі категорії:
        "Космічні загарбники", "Астероїди", "Лабіринти", "Рефлекси" та "Різні". Перші дві з них відповідають все ще
        використовуваним жанрам "фіксованого шутера" та "різноспрямованого шутера".
      </Paragraph>
      <Paragraph>
        У сфері персональних комп'ютерів два видання створили невелику кількість категорій на основі найбільш
        продаваного програмного забезпечення на початку 1980-х років: Softalk, який випускав свій список "Тридцятка
        найкращих" з 1980 по 1984 рік з жанрами стратегій, пригод, фентезі та аркад; і Computer Gaming World (CGW), який
        мав "Пристрій введення даних читачем", що спирався на дані читача. У 1981 році CGW спочатку мав лише три
        категорії: аркади, військові ігри та пригоди, але до 1989 року розширив свій жанровий список до стратегій,
        симуляторів, пригод, рольових пригод, військових ігор та екшенів/аркад.
      </Paragraph>
      <Paragraph>
        Виділяють такі жанри відеоігор:
        <Collapse>
          {genresArray.map((genre, index) => (
            <Panel header={genre.title} key={index}>
              {genre.items.length > 0 ? (
                <ul style={{listStyleType: 'disc'}}>
                  {genre.items.map((item) => (
                    <li key={item}>{item}</li>
                  ))}
                </ul>
              ) : (<p>No items available</p>)}
            </Panel>
          ))}
        </Collapse>
      </Paragraph>
    </Typography>
  );
};

export default GenresPage;
