import { Typography } from 'antd';

const GenresPage = () => {
  const { Title, Paragraph } = Typography;

  return (
    <Typography>
      <Title>Жанри відеоігор</Title>
      <Paragraph>
        Жанри відеоігор - це категорії, які класифікують відеоігри на основі їх
        геймплею, стилю та механіки. Ці жанри можуть мати значний вплив на вибір
        гравців та їхні ігрові переживання. Різні жанри можуть задовольнити
        різні інтереси та вподобання, надаючи гравцям широкий спектр можливостей
        для розваги та взаємодії. Традиційно, жанри відеоігор включають такі
        категорії, як екшн, пригодницькі, стратегічні, спортивні та рольові
        ігри.
      </Paragraph>
    </Typography>
  );
};

export default GenresPage;
