import unrealEngine from '../assets/engines/unrealEngine.jpg';
import fortnite from '../assets/engines/fortnite.jpg';

import cryEngine from '../assets/engines/cryEngine.png';
import farCry from '../assets/engines/farCry.png';

import unity from '../assets/engines/unity.png';
import cupHead from '../assets/engines/cupHead.avif';

import godot from '../assets/engines/godot.png';
import cityGame from '../assets/engines/cityGame.png';

import gamemaker from '../assets/engines/gamemaker.png';
import undertale from '../assets/engines/undertale.jpg';

import panda3d from '../assets/engines/panda3d.png';
import piratesOfCaribbean from '../assets/engines/pirates.jpg';

import renpy from '../assets/engines/renpy.png';
import stillwater from '../assets/engines/stillwater.png';

export const enginesParagraphs = {
  first: 'Ігровий рушій - це програмний фреймворк, призначений переважно для розробки відеоігор і зазвичай включає відповідні бібліотеки та допоміжні програми. Термін "рушій" схожий на термін "програмний рушій", що використовується в індустрії програмного забезпечення.',
  second: 'Ігровий рушій також може стосуватися програмного забезпечення для розробки, що використовує цю структуру, зазвичай пропонуючи набір інструментів та функцій для розробки ігор.',
  third: 'Розробники можуть використовувати ігрові рушії для створення ігор для відеоігрових консолей та інших типів комп\'ютерів. Основна функціональність, яку зазвичай надає ігровий рушій, може включати рушій рендерингу ("рендер") для 2D або 3D графіки, фізичний рушій або виявлення зіткнень (і реакцію на зіткнення), звук, сценарії, анімацію, штучний інтелект, мережу, потокову передачу даних, управління пам\'яттю, багатопотоковість, підтримку локалізації, графіку сцен і відеопідтримку для кінематографа. Розробники ігрових рушіїв часто економлять на процесі розробки ігор, повторно використовуючи/адаптуючи, здебільшого, один і той самий рушій для створення різних ігор або для портування ігор на різні платформи.',
  fourth: 'У багатьох випадках ігрові рушії надають набір візуальних інструментів розробки на додаток до багаторазових програмних компонентів. Ці інструменти, як правило, надаються в інтегрованому середовищі розробки, що дозволяє спростити та пришвидшити розробку ігор на основі даних. Розробники ігрових рушіїв часто намагаються випередити потреби реалізаторів, розробляючи надійні програмні пакети, які включають багато елементів, що можуть знадобитися розробнику для створення гри. Більшість пакетів ігрових рушіїв надають засоби, що полегшують розробку, такі як графіка, звук, фізика та функції штучного інтелекту (ШІ). Ці ігрові рушії іноді називають "проміжним програмним забезпеченням", оскільки, як і у випадку з бізнес-терміном, вони забезпечують гнучку та багаторазову програмну платформу, яка надає всю основну функціональність, необхідну для розробки ігрового додатку, зменшуючи при цьому витрати, складність та час виходу на ринок - усі ці фактори є критично важливими у висококонкурентній індустрії відеоігор.',
  fifth: 'Як і інші типи проміжного програмного забезпечення, ігрові рушії зазвичай забезпечують платформну абстракцію, дозволяючи одній і тій самій грі працювати на різних платформах (включно з ігровими консолями та персональними комп\'ютерами) з невеликими змінами у вихідному коді гри, якщо вони взагалі є. Часто програмісти розробляють ігрові рушії з компонентною архітектурою, яка дозволяє замінювати або розширювати певні системи рушія більш спеціалізованими (і часто дорожчими) компонентами ігрового проміжного програмного забезпечення. Деякі ігрові рушії складаються з низки слабко пов\'язаних між собою компонентів ігрового проміжного програмного забезпечення, які можна вибірково комбінувати для створення власного рушія, замість більш поширеного підходу до розширення або налаштування гнучкого інтегрованого продукту. Незалежно від досягнутого, розширюваність залишається високим пріоритетом для ігрових рушіїв через широке розмаїття застосувань, для яких вони застосовуються. Незважаючи на специфічність назви "ігровий рушій", кінцеві користувачі часто перепрофільовують ігрові рушії для інших видів інтерактивних додатків з графічними вимогами в реальному часі - таких як маркетингові демонстрації, архітектурні візуалізації, навчальні симуляції та моделюючі середовища.',
  sixth: 'Unreal Engine (UE) - ігровий рушій 3D-графіки, розроблений компанією Epic Games, вперше продемонстрований у 1998 році у грі-шутері від першої особи Unreal. Спочатку розроблений для комп\'ютерних шутерів від першої особи, він з тих пір використовується у різноманітних жанрах ігор, а також в інших індустріях, зокрема, в кіно та телебаченні. Unreal Engine написаний на C++ і відрізняється високим ступенем портативності, підтримуючи широкий спектр настільних, мобільних, консольних платформ та платформ віртуальної реальності.',
  seventh: 'Останнє покоління, Unreal Engine 5, було запущено у квітні 2022 року. Його вихідний код доступний на GitHub, а комерційне використання надається на основі моделі роялті. Epic відмовляється від своєї маржі роялті за ігри, поки розробники не отримають дохід у розмірі 1 мільйона доларів США, а також скасовує плату, якщо розробники публікують свої ігри в Epic Games Store. Epic включила в рушій функції від придбаних компаній, таких як Quixel, що, як вважається, сприяло зростанню доходів Fortnite.',
  eighth: 'CryEngine (стилізовано під CRYENGINE) - це ігровий рушій, розроблений німецьким розробником ігор Crytek. Він використовувався у всіх їхніх іграх, а початкова версія була використана у Far Cry, і продовжує оновлюватися для підтримки нових консолей та апаратного забезпечення для їхніх ігор. Він також використовувався для багатьох сторонніх ігор за ліцензійною схемою Crytek, включаючи Sniper: Ghost Warrior 2 та SNOW. Warhorse Studios використовує модифіковану версію рушія для своєї середньовічної RPG Kingdom Come: Deliverance. Ubisoft підтримує власну, сильно модифіковану версію рушія CryEngine з оригінальної Far Cry під назвою Dunia Engine, яка використовується в пізніших ітераціях серії Far Cry.',
  ninth: 'Згідно з різними анонімними повідомленнями, у квітні 2015 року CryEngine було ліцензовано Amazon за $50-70 млн. Згодом, у лютому 2016 року Amazon випустила власну перероблену та розширену версію CryEngine під назвою Amazon Lumberyard.',
  tenth: 'Unity - це кросплатформенний ігровий рушій, розроблений компанією Unity Technologies, вперше анонсований і випущений у червні 2005 року на конференції Apple Worldwide Developers Conference як ігровий рушій для Mac OS X. З того часу рушій поступово розширювався для підтримки різноманітних настільних, мобільних, консольних платформ та платформ віртуальної реальності. Він особливо популярний для розробки мобільних ігор для iOS та Android, вважається простим у використанні для розробників-початківців, а також популярний для розробки інді-ігор.',
  eleventh: 'Рушій можна використовувати для створення тривимірних (3D) і двовимірних (2D) ігор, а також інтерактивних симуляцій та інших додатків. Рушій був прийнятий в інших галузях, окрім відеоігор, таких як кіно, автомобільна промисловість, архітектура, інженерія, будівництво та Збройні сили США.',
  twelfth: 'Godot - це кросплатформенний, безкоштовний ігровий рушій з відкритим вихідним кодом, випущений під ліцензією MIT. Спочатку він був розроблений аргентинськими розробниками програмного забезпечення Хуаном Лінієцкі та Аріелем Манзуром для кількох компаній у Латинській Америці перед його публічним випуском. Середовище розробки працює на різних операційних системах, включаючи Linux, BSD, macOS та Microsoft Windows. Воно призначене для створення 2D і 3D ігор для ПК, мобільних і веб-платформ, а також може використовуватися для розробки неігрового програмного забезпечення, зокрема редакторів.',
  thirteen: 'Godot має на меті запропонувати повністю інтегроване середовище для розробки ігор. Воно дозволяє розробникам створювати гру, не потребуючи жодних інших інструментів, окрім тих, що використовуються для створення контенту (візуальні ресурси, музика тощо). Архітектура рушія побудована навколо концепції дерева "вузлів". Вузли організовані всередині "сцен", які є багаторазовими, інстанційними, успадкованими та вкладеними групами вузлів. Усі ресурси гри, включно зі скриптами та графічними ресурсами, зберігаються у файловій системі комп\'ютера (а не в базі даних). Таке рішення для зберігання призначене для полегшення співпраці між командами розробників ігор, які використовують системи контролю версій програмного забезпечення',
  fourteen: 'GameMaker (спочатку Animo, Game Maker (до 2011 року) та GameMaker Studio) - це серія кросплатформних ігрових рушіїв, створених Марком Овермарсом у 1999 році та розроблених YoYo Games з 2007 року. Остання ітерація GameMaker вийшла у 2022 році.',
  fifteen: 'GameMaker дозволяє створювати крос-платформні та різножанрові відеоігри за допомогою спеціальної мови візуального програмування drag-and-drop або скриптової мови, відомої як Game Maker Language, яка може бути використана для розробки більш складних ігор, які не можуть бути створені лише за допомогою функцій візуального програмування. GameMaker спочатку був розроблений для того, щоб дозволити програмістам-початківцям створювати комп\'ютерні ігри без особливих знань з програмування за допомогою цих дій. Останні версії програмного забезпечення також орієнтовані на просунутих розробників.',
  sixteen: 'Panda3D - це ігровий рушій, який включає в себе графіку, звук, ввід/вивід, виявлення зіткнень та інші можливості, необхідні для створення 3D-ігор. Panda3D - це вільне програмне забезпечення з відкритим вихідним кодом під переглянутою ліцензією BSD.',
  seventeen: 'Основною мовою розробки ігор для Panda3D є Python. Сам рушій написаний на C++ і використовує автоматичний генератор обгорток для розкриття повної функціональності рушія в інтерфейсі Python. Такий підхід дає розробнику переваги розробки на Python, такі як швидка розробка та вдосконалене управління пам\'яттю, але зберігає продуктивність скомпільованої мови в ядрі рушія. Наприклад, рушій інтегровано зі збирачем сміття Python, а структури рушія управляються автоматично.',
  eighteen: 'За замовчуванням у посібнику та прикладах програм використовується Python, а також C++ як альтернатива. Обидві мови повністю підтримуються. Python є найпоширенішою мовою серед розробників, але C++ також поширена.',
  nineteen: 'Серед користувачів Panda3D є розробники кількох великих комерційних ігор, кількох проектів з відкритим вихідним кодом та низки університетських курсів, які використовують коротку криву навчання Panda3D. Спільнота невелика, але активна, і на питання на форумі зазвичай відповідають швидко.',
  twenty: 'Ren\'Py Visual Novel Engine - це вільний ігровий рушій, який полегшує створення візуальних романів. Ren\'Py - це портфоліо з рен\'ай (恋愛), японського слова, що означає "романтичне кохання", спільного елементу ігор, створених за допомогою Ren\'Py; та Python, мови програмування, на якій працює Ren\'Py.',
  twentyOne: 'Ren\'Py включає можливість створення розгалужених історій, збереження файлових систем, відкату до попередніх точок історії, різноманітні переходи між сценами, DLC тощо. Рушій також дозволяє відтворювати як повноекранні фільми, так і анімовані спрайти, внутрішню анімацію (за допомогою вбудованої "Мови анімації та перекладу", або ATL), а також повну анімацію та кастомізацію елементів інтерфейсу користувача за допомогою "Мови екрану". Скрипти Ren\'Py мають синтаксис, подібний до скриптів, а також можуть включати блоки коду на Python, щоб просунуті користувачі могли додавати нові функції за власним бажанням. Крім того, до дистрибутиву рушія включено інструменти для маскування скриптів та архівування ігрових ресурсів, щоб зменшити порушення авторських прав.'
}

export const unrealEnginePictures = [
  {src: unrealEngine, title: 'Unreal Engine'},
  {src: fortnite, title: 'Fortnite'},
];

export const cryEnginePictures = [
  {src: cryEngine, title: 'CryEngine'},
  {src: farCry, title: 'FarCry'},
];

export const unityPictures = [
  {src: unity, title: 'Unity'},
  {src: cupHead, title: 'Cuphead'},
];

export const godotPictures = [
  {src: godot, title: 'Godot'},
  {src: cityGame, title: 'City Game Studio'},
];

export const gameMakerPictures = [
  {src: gamemaker, title: 'GameMaker'},
  {src: undertale, title: 'Undertale'},
];

export const panda3dPictures = [
  {src: panda3d, title: 'Panda3D'},
  {src: piratesOfCaribbean, title: 'Pirates of the Caribbean Online'},
];

export const renpyPictures = [
  {src: renpy, title: 'Ren\'Py'},
  {src: stillwater, title: 'Stillwater'},
];







