export const gameCompaniesParagraph = {
  first: '"Відомі компанії відеоігор" - це перелік компаній, що займаються розробкою та виданням відеоігор. Індустрія\n' +
    '        відеоігор є однією з найбільш прибуткових та швидкорозвиваючихся галузей в світі розваг. У цьому переліку\n' +
    '        включені компанії з різних країн світу, від яких залежить значна частина відеоігрової індустрії.',
  second: 'Однією з найвідоміших компаній відеоігор є американська компанія Activision Blizzard. Її найвідоміші ігри\n' +
    '        включають Call of Duty, World of Warcraft, Diablo та Overwatch. Компанія також є власником ряду студій, таких як\n' +
    '        Treyarch, Infinity Ward та Blizzard Entertainment.',
  third: 'Electronic Arts (EA) - ще одна відома американська компанія відеоігор. EA відома своїми іграми в жанрах спорту,\n' +
    '        перегонів та шутерів від першої особи. До найвідоміших її ігор належать серії FIFA, Madden NFL, Need for Speed\n' +
    '        та Battlefield.',
  fourth: 'Інша відома компанія відеоігор - японська Nintendo. Вона відома своїми іграми для портативних та домашніх\n' +
    '        ігрових консолей, таких як Nintendo Switch та Nintendo 3DS. До найвідоміших її ігор належать серії Super Mario,\n' +
    '        The Legend of Zelda та Pokemon.',
  fifth: 'Ubisoft - французька компанія, заснована у 1986 році. Вона відома своїми іграми в жанрах екшн, рольових ігор та\n' +
    '        шутерів. До найвідоміших ігор компанії належать серії Assassin\'s Creed, Far Cry та Tom Clancy\'s Rainbow Six.',
  sixth: 'Rockstar Games - американська компанія, заснована у 1998 році. Вона відома своїми іграми в жанрах екшн та\n' +
    '        відкритого світу. До найвідоміших її ігор належать серії Grand Theft Auto та Red Dead Redemption.',
  seventh: 'Bethesda Softworks - американська компанія, заснована у 1986 році. Вона відома своїми іграми в жанрах рольових\n' +
    '        ігор та відкритого світу. До найвідоміших ігор компанії належать серії The Elder Scrolls та Fallout.',
  eighth: 'Square Enix - є японською компанією, яка займається розробкою та виданням відеоігор. Вона відома своїми іграми в\n' +
    '        жанрі рольових ігор та пригодницьких ігор. До найвідоміших ігор компанії належать Final Fantasy, Dragon Quest та\n' +
    '        Tomb Raider.',
  ninth: 'Naughty Dog - це американська компанія, заснована у 1984 році. Вона відома своїми іграми в жанрі пригодницьких\n' +
    '        ігор та екшн. До найвідоміших ігор компанії належать серії Uncharted та The Last of Us.',
  tenth: 'Valve Corporation - американська компанія, заснована у 1996 році. Вона відома своїми іграми та платформою Steam.\n' +
    '        До найвідоміших ігор компанії належать серії Half-Life, Portal та Counter-Strike.',
  eleventh: 'CD Projekt Red - польська компанія, заснована у 1994 році. Вона відома своїми рольовими іграми та відкритими\n' +
    '        світами. До найвідоміших ігор компанії належать серії The Witcher та Cyberpunk 2077.',
  twelfth: 'Bioware - канадська компанія, заснована у 1995 році. Вона відома своїми рольовими іграми з акцентом на глибокий\n' +
    '        сюжет та характеризацію персонажів. До найвідоміших ігор компанії належать серії Baldur\'s Gate, Mass Effect та\n' +
    '        Dragon Age.',
}